# GetServer Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..GetServer Method
ExternalService Class See Also
---
Returns the instance that provides implementation for a registered server.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IExternalServer GetServer(
	Guid serverId
)
```

Visual Basic
---
```text
Public Function GetServer ( _
	serverId As Guid _
) As IExternalServer
```

Visual C++
---
```text
public:
IExternalServer^ GetServer(
	Guid serverId
)
```

# ### Parameters
serverId
    Type: System..::..Guid Id of a registered server
# ### Return Value
An instance of the server interface. NULL is returned if the server is invalid (e.g. destroyed)
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given Id is not a valid GUID value. |

# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace